src/Catalogs/ТребуемыеЗначенияПараметровИспытаний/ТребуемыеЗначенияПараметровИспытаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТребуемыеЗначенияПараметровИспытаний</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СечениеЖилы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПараметра</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ОбщегоНазначенияСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции	
Функция ОпределитьРазрядностьЧисла(ИсследуемоеЧисло) Экспорт
	
	//КоличествоРазрядов = Макс(СтрДлина(ИсследуемоеЧисло%1)-2,0);	
КонецФункции  

Функция ПолучитьТребуемыеЗначенияИспытания(СечениеЖилы, ИмяГруппы) Экспорт 
		 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТребуемыеЗначенияПараметровИспытаний.СечениеЖилы КАК СечениеЖилы,
	|	ТребуемыеЗначенияПараметровИспытаний.ЗначениеПараметра КАК ЗначениеПараметра,
	|	ТребуемыеЗначенияПараметровИспытаний.Родитель КАК Родитель
	|ИЗ
	|	Справочник.ТребуемыеЗначенияПараметровИспытаний КАК ТребуемыеЗначенияПараметровИспытаний
	|ГДЕ
	|	ТребуемыеЗначенияПараметровИспытаний.СечениеЖилы = &СечениеЖилы
	|	И ТребуемыеЗначенияПараметровИспытаний.Родитель В ИЕРАРХИИ(&Родитель)";
	
	
	Запрос.УстановитьПараметр("Родитель", Справочники.ТребуемыеЗначенияПараметровИспытаний.НайтиПоНаименованию(ИмяГруппы));
	Запрос.УстановитьПараметр("СечениеЖилы", СечениеЖилы);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаНайденныхЗначений = РезультатЗапроса.Выгрузить();
	Если Не ТаблицаНайденныхЗначений.Количество()>1 Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		//
		Если  ВыборкаДетальныеЗаписи.Следующий()  Тогда
			Если НЕ ВыборкаДетальныеЗаписи.СечениеЖилы = 185 Тогда
				Возврат ВыборкаДетальныеЗаписи.ЗначениеПараметра ;
			Иначе
				Возврат ВыборкаДетальныеЗаписи.ЗначениеПараметра;
				
			КонецЕсли;
			
		Иначе
			Возврат 0;
			
		КонецЕсли;
	Иначе 
		Для Каждого СтрокаТЧ Из ТаблицаНайденныхЗначений Цикл
			Если СтрокаТЧ.Родитель.Наименование = "М" Тогда
			Возврат СтрокаТЧ.ЗначениеПараметра;	
			КонецЕсли;
		КонецЦикла;
		КонецЕсли;
	 КонецФункции   
		 
Функция  ПривестиКФормату(ВходящиеДанные, ИменаГрупп, ДанныеКабеля) Экспорт
	
	Если ИменаГрупп.ИмяГруппыЖила = "Сопротивление жилы Контрольные"  Тогда 
		Возврат Формат(ВходящиеДанные, "ЧЦ=15; ЧДЦ=1; ЧН=-");
	Иначе
		Если ДанныеКабеля.СечениеЖилы<=16 Тогда
			
			Возврат Формат(ВходящиеДанные, "ЧЦ=15; ЧДЦ=2; ЧН=-");	 
		Иначе 
			Возврат Формат(ВходящиеДанные, "ЧЦ=15; ЧДЦ=3; ЧН=-");	
		КонецЕсли; 
	КонецЕсли;    
		 
КонецФункции 

функция СертификатСоответствия(ЭлементПоиска)  Экспорт 
	
		СтруктураРеквизитов = Новый Структура; 
		
		СтруктураРеквизитов.Вставить("СертификатСоответствияЕАЭRU", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементПоиска, "СертификатСоответствияЕАЭRU"));
		СтруктураРеквизитов.Вставить("НачалоСрокаДействияЕАЭRU", Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементПоиска, "НачалоСрокаДействияЕАЭRU"), "ДЛФ=D")); 
		СтруктураРеквизитов.Вставить("ОкончаниеСрокаДействияЕАЭRU", Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементПоиска, "ОкончаниеСрокаДействияЕАЭRU"), "ДЛФ=D"));
		
		Возврат СтруктураРеквизитов;
	   
КонецФункции
#КонецОбласти
